tutorials/OF230_240/irreg45degTank/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        irregular;

genAbs          1;

absDir          0.0;

nPaddles        25;

tSmooth         3;

wavePeriods
842
(
1.231250
1.231250
1.231250
1.231250
1.231250
1.231250
1.110664
1.231250
1.110664
1.231250
1.351837
1.110664
1.231250
1.351837
1.110664
1.231250
1.351837
1.110664
1.231250
1.351837
1.110664
1.231250
1.351837
4.125324
1.110664
1.231250
1.351837
4.004737
4.125324
1.110664
1.231250
1.351837
1.472423
4.004737
4.125324
1.110664
1.231250
1.351837
1.472423
3.884151
4.004737
4.125324
4.245910
4.366496
1.110664
1.231250
1.351837
1.472423
3.884151
4.004737
4.125324
4.245910
4.366496
1.110664
1.231250
1.351837
1.472423
3.884151
4.004737
4.125324
4.245910
4.366496
4.487083
1.110664
1.231250
1.351837
1.472423
1.593010
3.884151
4.004737
4.125324
4.245910
4.366496
4.487083
1.110664
1.231250
1.351837
1.472423
1.593010
3.884151
4.004737
4.125324
4.245910
4.366496
4.487083
4.607669
1.110664
1.231250
1.351837
1.472423
1.593010
3.884151
4.004737
4.125324
4.245910
4.366496
4.487083
4.607669
...
);
waveHeights
842
(
0.004247
0.004603
0.004974
0.005360
0.005760
0.006172
0.004247
0.006596
0.004429
0.007031
0.004138
0.004611
0.007474
0.004523
0.004793
0.007926
0.004926
0.004973
0.008384
0.005346
0.005152
0.008847
0.005780
0.004300
0.005329
0.009313
0.006228
0.004287
0.004531
0.005504
0.009781
0.006688
0.004117
0.004481
0.004763
0.005675
0.010248
0.007157
0.004390
0.004116
0.004674
0.004994
0.004364
0.004150
0.005843
0.010713
0.007634
0.004666
0.004265
0.004865
0.005225
0.004665
0.004430
0.006008
0.011173
0.008116
0.004945
0.004410
0.005054
0.005454
0.004969
0.004714
0.004278
0.006167
0.011627
0.008600
0.005224
0.004209
0.004553
0.005239
0.005680
0.005276
0.005000
0.004532
0.006322
0.012073
0.009083
0.005502
0.004422
0.004692
0.005420
0.005902
0.005583
0.005285
0.004787
0.004247
0.006471
0.012509
0.009564
0.005777
0.004632
0.004826
0.005596
0.006119
0.005888
0.005570
0.005039
0.004467
...
);
wavePhases
842
(
1.977467
2.549666
-2.343711
2.597317
0.831638
-2.528728
-1.391737
0.294565
2.874600
2.920981
-2.151280
2.956822
2.872465
-0.091888
1.886718
-2.250094
-0.491588
2.612143
1.835993
2.887076
0.978548
-2.917210
2.193644
2.726860
1.123026
1.619429
1.527646
-0.677158
0.976896
-2.065995
1.294626
-2.941581
-1.401634
-2.851489
-2.531296
2.032345
1.224144
-1.149198
2.828829
-2.925162
-0.384881
-0.744190
1.668291
1.854796
-1.967437
-0.064312
-0.341892
0.919312
1.315478
1.600244
-1.407276
1.129105
0.974509
-2.119873
-2.393908
-0.010279
2.888656
-1.002886
0.535753
-1.735341
1.578757
-1.538783
0.037429
1.250836
2.456118
2.885813
0.296664
-2.270590
-2.203551
-1.523621
2.140790
-1.543891
1.974710
-1.611480
2.697143
-0.942580
-1.906348
-1.563986
0.729130
-0.167831
-0.932051
2.078658
0.535730
0.312423
2.621305
-1.345613
1.616037
1.594227
-0.751181
0.426136
-2.664986
-2.802614
0.193507
1.754059
2.726970
-2.325368
0.432432
-0.192324
...
);
waveDirs
842
(
-27.150838
-25.139665
-23.128492
-21.117318
-19.106145
-17.094972
-15.083799
-15.083799
-13.072626
-13.072626
-13.072626
-11.061453
-11.061453
-11.061453
-9.050279
-9.050279
-9.050279
-7.039106
-7.039106
-7.039106
-5.027933
-5.027933
-5.027933
-5.027933
-3.016760
-3.016760
-3.016760
-3.016760
-3.016760
-1.005587
-1.005587
-1.005587
-1.005587
-1.005587
-1.005587
1.005587
1.005587
1.005587
1.005587
1.005587
1.005587
1.005587
1.005587
1.005587
3.016760
3.016760
3.016760
3.016760
3.016760
3.016760
3.016760
3.016760
3.016760
5.027933
5.027933
5.027933
5.027933
5.027933
5.027933
5.027933
5.027933
5.027933
5.027933
7.039106
7.039106
7.039106
7.039106
7.039106
7.039106
7.039106
7.039106
7.039106
7.039106
7.039106
9.050279
9.050279
9.050279
9.050279
9.050279
9.050279
9.050279
9.050279
9.050279
9.050279
9.050279
9.050279
11.061453
11.061453
11.061453
11.061453
11.061453
11.061453
11.061453
11.061453
11.061453
11.061453
11.061453
11.061453
...
);

// ************************************************************************* //
